Revit 2024 API
BasicFileInfo.LanguageWhenSaved Property
 Return the language active for the last save
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public LanguageType LanguageWhenSaved { get; }
Visual Basic
Public ReadOnly Property LanguageWhenSaved As LanguageType
	Get
Visual C++
public:
property LanguageType LanguageWhenSaved {
	LanguageType get ();
}
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace